데이터 시각화 패키지인 seaborn에서 제공하는 dataset인 titanic을 불러온다.

In [14]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

데이터프레임도 마찬가지로 head(), tail() 메서드를 사용할 수 있다. 디폴트 값은 5개씩 출력한다. 마찬가지로 sample(), nunique()도 사용 가능하다.

In [3]:
titanic.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

dtypes 속성으로 각 컬럼에 대해 데이터 타입을 조회할 수 있다.

In [4]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

sum() 메서드도 사용할 수 있다. numeric_only 키워드로 수치형 컬럼만 적용할 수 있다. 마찬가지로 mean(), medina(), std() 모두 사용할 수 있다.

In [5]:
titanic.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

DataFrame에 대한 수학 연산 대부분은 axis를 키워드 인수로 갖는다. 0이거나 row일 경우 행간 연산을, 1이거나 columns일 경우 열간 연산을 한다.

In [8]:
titanic.mean(axis=0, numeric_only=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [9]:
titanic.mean(axis=1, numeric_only=True)

0       4.281250
1      14.035412
2       4.865625
3      11.387500
4       6.006250
         ...
886     5.500000
887     6.500000
888     4.207143
889     7.500000
890     5.593750
Length: 891, dtype: float64

nlargest() 또는 nsmallest()를 사용하려면 column을 지정해 줘야 한다.

In [12]:
titanic.nlargest(10, columns = ['fare'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
311,1,1,female,18.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
742,1,1,female,21.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
118,0,1,male,24.0,0,1,247.5208,C,First,man,True,B,Cherbourg,no,False

nba 데이터를 불러와 보자.

In [20]:
nba = pd.read_csv('datas/nba.csv', parse_dates=['Birthday'])
nba

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

연습문제 - 각 컬럽이 어떤 타입을 갖는지 확인하고, 각각의 데이터 유형이 몇 개씩 존재하나 확인하시오.

In [21]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [30]:
nba.dtypes.value_counts()

object            3
datetime64[ns]    1
int64             1
dtype: int64

연습문제 - 위 데이터의 차원의 수, 모양, 칼럼 인덱스, 로우 인덱스를 각각 구해보시오.

In [45]:
nba.ndim

2

In [35]:
nba.shape

(450, 5)

In [43]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [44]:
nba.index

RangeIndex(start=0, stop=450, step=1)

연습문제 - 위 데이터에서 결측치를 갖는 칼럼이 존재하는지 확인하고, 존재한다면 몇 개의 데이터나 결측치인지 구하라. 또 전체 데이터의 개수도 구하여라.

In [58]:
nba.index.isnull().sum()

0

In [57]:
nba.count().sum()

2250

연습문제 - 각 컬럼마다 고유한 값을 몇 개씩 갖는지 조회해 보시오. 또 컬럼마다 가장 큰 값과 작은 값을 구해보시오.

In [60]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [65]:
nba.nlargest(1, columns=['Birthday'])

                Name             Team Position   Birthday   Salary
136  Sekou Doumbouya  Detroit Pistons       SF 2000-12-23  3285120

In [67]:
nba.nsmallest(1, columns=['Birthday'])

            Name           Team Position   Birthday   Salary
98  Vince Carter  Atlanta Hawks       PF 1977-01-26  2564753

In [79]:
nba.nlargest(1, columns=['Salary'])

              Name                   Team Position   Birthday    Salary
205  Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758

In [69]:
nba.nsmallest(1, columns=['Salary'])

            Name                Team Position   Birthday  Salary
4  Marial Shayok  Philadelphia 76ers        G 1995-07-26   79568

In [74]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [76]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

In [77]:
nba.nlargest(5, columns=['Salary'])

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000
264       James Harden        Houston Rockets       PG 1989-08-26  38199000

In [82]:
nba.nsmallest(5, columns=['Birthday'])

               Name               Team Position   Birthday    Salary
98     Vince Carter      Atlanta Hawks       PF 1977-01-26   2564753
196   Udonis Haslem         Miami Heat        C 1980-06-09   2564753
262     Kyle Korver    Milwaukee Bucks       PF 1981-03-17   6004753
149  Tyson Chandler    Houston Rockets        C 1982-10-02   2564753
415  Andre Iguodala  Memphis Grizzlies       SF 1984-01-28  17185185

In [84]:
nba['Salary'].sum()

3444112694

In [85]:
nba['Salary'].mean()

7653583.764444444

In [86]:
nba['Salary'].median()

3303074.5

In [87]:
nba['Salary'].std()

9288810.298497694

각 컬럼마다 정렬을 달리하고 싶으면 asending 인수에 값을 리스트로 전달하고 그 안의 요소는 컬럼의 개수에 맞춰 순서대로 True/False값을 넣어주면 된다. row index를 기준으로 정렬하려면 sort_index()를 활용한다.

In [88]:
titanic.sort_index(ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False

column 인덱스를 기준으로 정렬하려면 axis에 1을 넣으면 된다.

In [89]:
titanic.sort_index(axis=1)

,adult_male,age,alive,alone,class,deck,embark_town,embarked,fare,parch,pclass,sex,sibsp,survived,who
0,True,22.0,no,False,Third,NaN,Southampton,S,7.2500,0,3,male,1,0,man
1,False,38.0,yes,False,First,C,Cherbourg,C,71.2833,0,1,female,1,1,woman
2,False,26.0,yes,True,Third,NaN,Southampton,S,7.9250,0,3,female,0,1,woman
3,False,35.0,yes,False,First,C,Southampton,S,53.1000,0,1,female,1,1,woman
4,True,35.0,no,True,Third,NaN,Southampton,S,8.0500,0,3,male,0,0,man
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,True,27.0,no,True,Second,NaN,Southampton,S,13.0000,0,2,male,0,0,man
887,False,19.0,yes,True,First,B,Southampton,S,30.0000,0,1,female,0,1,woman
888,False,NaN,no,False,Third,NaN,Southampton,S,23.4500,2,3,female,1,0,woman
889,True,26.0,yes,True,First,C,Cherbourg,C,30.0000,0,1,male,0,1,man
890,True,32.0,no,True,Third,NaN,Queenstown,Q,7.7500,0,3,male,0,0,man

연습문제 - 타이타닉호 승객에 대해 성별 인원수, 나이별 인원수, 선실별 인원수, 사망/생존 인원수를 구하고 내림차순으로 정렬해라.

In [92]:
titanic.value_counts('sex')

sex
male      577
female    314
dtype: int64

In [94]:
titanic.value_counts('age').sort_values(ascending=False)

age
24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
0.42      1
66.00     1
70.50     1
74.00     1
80.00     1
Length: 88, dtype: int64

In [95]:
titanic.value_counts('class').sort_values(ascending=False)

class
Third     491
First     216
Second    184
dtype: int64

In [98]:
titanic.value_counts('alive').sort_values(ascending=False)

alive
no     549
yes    342
dtype: int64

Pandas는 넘파이 배열과 같이 콤르르 사용한 2차원 인덱싱을 지원하기 위해 loc와 iloc를 지원한다. loc는 label 값 기반이고 iloc는 정수 값 기반이다. 다음처럼 사용할 수 있다.

In [103]:
data = np.arange(10, 22).reshape(3, 4)
df = pd.DataFrame(data=data, columns=['A', 'B', 'C', 'D'], index=['a', 'b', 'c'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [104]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int64

콤마 없이 인덱스를 하나만 넣으면 row를 반환한다. 인덱스 데이터의 슬라이스도 가능하다. 이 때는 loc를 쓰지 않은 것과 결과가 같다.

In [106]:
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

bool Series로 row를 기준으로 인덱싱할 수 있다.

In [107]:
df.A>15

a    False
b    False
c     True
Name: A, dtype: bool

In [108]:
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

값만 반환하려면 .at['row', 'column']이 더 빠르다.

In [109]:
df.at['a', 'A']

10

연습문제 - 타이타닉호 승객의 평균 나이를 구하시오.

In [111]:
titanic.age.mean().round(1)

29.7

연습문제 - 타이타닉호 여성 승객의 평균 나이를 구하시오.

In [112]:
titanic.loc[titanic.sex=='female'].age.mean().round(1)

27.9

연습문제 - 타이타닉호 승객 중 1등실 선실의 여성 승객의 평균 나이를 구하시오.

In [121]:
titanic.loc[(titanic.sex=='female') & (titanic.pclass==1)].age.mean().round(1)

34.6

연습문제

In [196]:
teams = pd.read_csv('datas/teams.csv')
o = list(range(1, 8))*4
np.random.shuffle(o)
teams['team'] = o
teams.sort_values('team')

     성명 성별  team
8   박수현  여     1
22  정현호  남     1
17  이윤진  여     1
6   노재승  남     1
18  이주현  여     2
19  이주현  남     2
27  한혜원  여     2
1   강호정  남     2
4   김지성  남     3
3   김정인  여     3
2   고유리  여     3
25  채경민  남     3
7   박기영  남     4
20  임혜신  여     4
12  유영은  여     4
16  이유단  여     4
24  조재희  남     5
0   강예림  여     5
14  유준선  남     5
26  최진명  남     5
21  장서현  여     6
5   김지오  여     6
15  윤영주  여     6
13  유예빈  여     6
11  유승현  남     7
10  서덕원  남     7
23  조세연  남     7
9   배선화  여     7

In [197]:
teams = teams.sort_values('team')
teams.to_csv('datas/teams_result.csv')

In [208]:
for i in range(teams.team.max()):
    temp = teams.loc[teams.team==(i+1)]['성명']
    print(f'{i+1}팀: ',list(temp))

1팀:  ['박수현', '정현호', '이윤진', '노재승']
2팀:  ['이주현', '이주현', '한혜원', '강호정']
3팀:  ['김지성', '김정인', '고유리', '채경민']
4팀:  ['박기영', '임혜신', '유영은', '이유단']
5팀:  ['조재희', '강예림', '유준선', '최진명']
6팀:  ['장서현', '김지오', '윤영주', '유예빈']
7팀:  ['유승현', '서덕원', '조세연', '배선화']

In [203]:
teams['성명']

8     박수현
22    정현호
17    이윤진
6     노재승
18    이주현
19    이주현
27    한혜원
1     강호정
4     김지성
3     김정인
2     고유리
25    채경민
7     박기영
20    임혜신
12    유영은
16    이유단
24    조재희
0     강예림
14    유준선
26    최진명
21    장서현
5     김지오
15    윤영주
13    유예빈
11    유승현
10    서덕원
23    조세연
9     배선화
Name: 성명, dtype: object

In [209]:
teams = pd.read_csv('datas/teams.csv')
o = list(range(1, 8))*4
np.random.shuffle(o)
teams['team'] = o
teams = teams.sort_values('team')
for i in range(teams.team.max()):
    temp = teams.loc[teams.team==(i+1)]['성명']
    print(f'{i+1}팀: ',list(temp))

1팀:  ['노재승', '이유단', '최진명', '서덕원']
2팀:  ['고유리', '정현호', '이주현', '박기영']
3팀:  ['강예림', '조세연', '장서현', '한혜원']
4팀:  ['배선화', '김지성', '김정인', '강호정']
5팀:  ['윤영주', '이윤진', '이주현', '임혜신']
6팀:  ['유준선', '박수현', '유승현', '유예빈']
7팀:  ['유영은', '김지오', '조재희', '채경민']